#include "Data.h"

int _stateMenu;

void Menu()
{
    cout << "------------------------------------------------------------------------\n";
    cout << "Виберіть дію:" << endl
        << "0. Вихід з програми" << endl
        << "1. Отримати перелік і загальне число пунктів прийому замовлень на фотороботи по філіям, по кіосках прийому замовлень, в цілому по фото центру." << endl
        << "2. Отримати перелік і загальне число замовлень на фотороботи по філіям, кіоскам прийому замовлень, в цілому по фото центру, що надійшли протягом деякого періоду часу." << endl
        << "3. Отримати перелік і загальне число замовлень (окремо простих і термінових) на окремі види фото робіт для вказаної філії, кіоску прийому замовлень, що надійшли протягом деякого періоду часу." << endl
        << "4. Отримати суму виручки із замовлень (окремо простих і термінових) на окремі види фото робіт для вказаної філії, кіоску прийому замовлень, що надійшли протягом деякого періоду часу." << endl
        << "5. Отримати кількість надрукованих фотографій, простих і термінових замовлень для вказаної філії, кіоску прийому замовлень, фото центру в цілому за певний період часу." << endl
        << "6. Отримати кількість виявлених фотоплівок, простих і термінових замовлень для вказаної філії, кіоску прийому замовлень, фото центру в цілому за певний період часу." << endl
        << "7. Отримати перелік постачальників в цілому по фото центру, постачальників окремих видів фототоварів, які зробили поставки за деякий період, поставки певного обсягу." << endl
        << "8. Отримати список клієнтів в цілому по фото центру, клієнтів зазначеної філії, які мають знижки або зробили замовлення певного обсягу." << endl
        << "9. Отримати суму виручки від реалізації фототоварів в цілому по фото центру, для вказаної філії, проданих протягом деякого періоду часу." << endl
        << "10. Отримати перелік фототоварів і фірм-виробників, які користуються найбільшим попитом в цілому по фото центру, у зазначеній філії." << endl
        << "11. Отримати перелік реалізованих фототоварів і обсяги їх реалізації в цілому по фото центру, для вказаної філії, проданих протягом деякого періоду часу." << endl
        << "12. Отримати перелік робочих місць фото центру в цілому та для зазначеного профілю." << endl
        << "Ваш вибір: ";
    cin >> _stateMenu;
    cout << "------------------------------------------------------------------------\n";
}

int main()
{
	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);
    
    PhotoCenter photoCenter;
    Orders orders;
    Revenue revenue;

    createData(photoCenter, orders);
    int action, action_;

    Menu();
    while (_stateMenu != 0)
    {
        switch (_stateMenu)
        {
        case 1:
            printBranchesAndKiosks(photoCenter);
            Menu();
            break;
        case 2:
            printOrders(orders);
            Menu();
            break;
        case 3:
            cout << "Отримати перелік замовлень для вказаної філії(1) чи кіоску(2)? ";
            cin >> action;

            if (action == 1) {
                cout << "Отримати перелік замовлень для філії №(1 - 3): ";
                cin >> action_;

                if (action_ >= 1 && action_ <= 3) {
                    printOrdersForBranchByNumber(orders, action_);
                } else {
                    cout << "------------------------------------------------------------------------\n";
                    cout << "Філії з таким номером немає!\n";
                }
            }
            else if (action == 2) {
                cout << "Отримати перелік замовлень для кіоску №(1 - 4): ";
                cin >> action_;

                if (action_ >= 1 && action_ <= 4) {
                    printOrdersForKioskByNumber(orders, action_);
                    
                } else {
                    cout << "------------------------------------------------------------------------\n";
                    cout << "Кіоску з таким номером немає!\n";
                }
            } 
            else {
                cout << "------------------------------------------------------------------------\n";
                cout << "Такого варіанту немає!\n";
            }
            Menu();
            break;
        case 4:
            cout << "Отримати звіт про суму виручки із замовлень для вказаної філії(1) чи кіоску(2)? ";
            cin >> action;

            if (action == 1) {
                cout << "Отримати звіт про суму виручки із замовлень для філії №(1 - 3): ";
                cin >> action_;

                if (action_ >= 1 && action_ <= 3) {
                    branchProfitFromOrdersСalc(orders, revenue, action_);
                    printBranchProfitFromOrders(orders, revenue, action_);
                }
                else {
                    cout << "------------------------------------------------------------------------\n";
                    cout << "Філії з таким номером немає!\n";
                }
            }
            else if (action == 2) {
                cout << "Отримати звіт про суму виручки із замовлень для кіоску №(1 - 4): ";
                cin >> action_;

                if (action_ >= 1 && action_ <= 4) {
                    kioskProfitFromOrdersСalc(orders, revenue, action_);
                    printKioskProfitFromOrders(orders, revenue, action_);
                }
                else {
                    cout << "------------------------------------------------------------------------\n";
                    cout << "Кіоску з таким номером немає!\n";
                }
            }
            else {
                cout << "------------------------------------------------------------------------\n";
                cout << "Такого варіанту немає!\n";
            }
            Menu();
            break;
        case 5:
            cout << "Отримати звіт про кількість надрукованих фотографій для вказаної філії(1) чи кіоску(2)? ";
            cin >> action;

            if (action == 1) {
                cout << "Отримати звіт про кількість надрукованих фотографій для філії №(1 - 3): ";
                cin >> action_;

                if (action_ >= 1 && action_ <= 3) {
                    printBranchNumOfPhotos(orders, action_);
                }
                else {
                    cout << "------------------------------------------------------------------------\n";
                    cout << "Філії з таким номером немає!\n";
                }
            }
            else if (action == 2) {
                cout << "Отримати звіт про кількість надрукованих фотографій для кіоску №(1 - 4): ";
                cin >> action_;

                if (action_ >= 1 && action_ <= 4) {
                    printKioskNumOfPhotos(orders, action_);

                }
                else {
                    cout << "------------------------------------------------------------------------\n";
                    cout << "Кіоску з таким номером немає!\n";
                }
            }
            else {
                cout << "------------------------------------------------------------------------\n";
                cout << "Такого варіанту немає!\n";
            }
            Menu();
            break;
        case 6:
            cout << "Отримати звіт про кількість проявлених фотоплівок для вказаної філії(1) чи кіоску(2)? ";
            cin >> action;

            if (action == 1) {
                cout << "Отримати звіт про кількість проявлених фотоплівок для філії №(1 - 3): ";
                cin >> action_;

                if (action_ >= 1 && action_ <= 3) {
                    printBranchNumOfFilms(orders, action_);
                }
                else {
                    cout << "------------------------------------------------------------------------\n";
                    cout << "Філії з таким номером немає!\n";
                }
            }
            else if (action == 2) {
                cout << "Отримати звіт про кількість проявлених фотоплівок для кіоску №(1 - 4): ";
                cin >> action_;

                if (action_ >= 1 && action_ <= 4) {
                    printKioskNumOfFilms(orders, action_);

                }
                else {
                    cout << "------------------------------------------------------------------------\n";
                    cout << "Кіоску з таким номером немає!\n";
                }
            }
            else {
                cout << "------------------------------------------------------------------------\n";
                cout << "Такого варіанту немає!\n";
            }
            Menu();
            break;
        case 7:
            printSuppliers(photoCenter);
            Menu();
            break;
        case 8:
            cout << "Отримати перелік клієнтів в цілому по фото центру(1) чи для вказаної філії(2)? ";
            cin >> action;

            if (action == 1) {
                printСlientListOfPhotoCenter(photoCenter);
            }
            else if (action == 2) {
                cout << "Отримати перелік клієнтів які мають знижки або зробили замовлення певного обсягу в філії №(1-3): ";
                cin >> action_;

                if (action_ >= 1 && action_ <= 3) {
                    printСlientListOfBranch(photoCenter, action_);
                }
                else {
                    cout << "------------------------------------------------------------------------\n";
                    cout << "Філії з таким номером немає!\n";
                }
            }
            else {
                cout << "------------------------------------------------------------------------\n";
                cout << "Такого варіанту немає!\n";
            }
            Menu();
            break;
        case 9:
            cout << "Отримати суму виручки з проданих фототоварів в цілому по фото центру(1) чи для вказаної філії(2)? ";
            cin >> action;

            if (action == 1) {
                printPhotoCenterProfitFromSoldProducts(photoCenter);
            }
            else if (action == 2) {
                cout << "Отримати суму виручки з проданих фототоварів для філії №(1-3): ";
                cin >> action_;

                if (action_ >= 1 && action_ <= 3) {
                    printBranchProfitFromSoldProducts(photoCenter, action_);
                }
                else {
                    cout << "------------------------------------------------------------------------\n";
                    cout << "Філії з таким номером немає!\n";
                }
            }
            else {
                cout << "------------------------------------------------------------------------\n";
                cout << "Такого варіанту немає!\n";
            }
            Menu();
            break;
        case 10:
            cout << "Отримати перелік фототоварів і фірм-виробників, які користуються найбільшим попитом в цілому по фото центру(1) чи для вказаної філії(2)? ";
            cin >> action;

            if (action == 1) {
                printTopPhotoCenterSoldProducts(photoCenter);
            }
            else if (action == 2) {
                cout << "Отримати перелік фототоварів і фірм-виробників, які користуються найбільшим попитом у філії №(1-3): ";
                cin >> action_;

                if (action_ >= 1 && action_ <= 3) {
                    printTopBranchSoldProducts(photoCenter, action_);
                }
                else {
                    cout << "------------------------------------------------------------------------\n";
                    cout << "Філії з таким номером немає!\n";
                }
            }
            else {
                cout << "------------------------------------------------------------------------\n";
                cout << "Такого варіанту немає!\n";
            }
            Menu();
            break;
        case 11:
            cout << "Отримати перелік проданих фототоварів та їх обсяги в цілому по фото центру(1) чи для вказаної філії(2)? ";
            cin >> action;

            if (action == 1) {
                printPhotoCenterSoldProducts(photoCenter);
            }
            else if (action == 2) {
                cout << "Отримати перелік проданих фототоварів та їх обсяги для філії №(1-3): ";
                cin >> action_;

                if (action_ >= 1 && action_ <= 3) {
                    printBranchSoldProducts(photoCenter, action_);
                }
                else {
                    cout << "------------------------------------------------------------------------\n";
                    cout << "Філії з таким номером немає!\n";
                }
            }
            else {
                cout << "------------------------------------------------------------------------\n";
                cout << "Такого варіанту немає!\n";
            }
            Menu();
            break;
        case 12:
            cout << "Отримати перелік робочих місць фото центру в цілому(1) чи для зазначеного профілю(2)? ";
            cin >> action;

            if (action == 1) {
                printListOfWorkers(photoCenter);
            }
            else if (action == 2) {
                printListOfPost(photoCenter);
            }
            else {
                cout << "------------------------------------------------------------------------\n";
                cout << "Такого варіанту немає!\n";
            }
            Menu();
            break;
        default:
            cout << "Такого пункту немає!" << endl;
            Menu();
            break;
        }
    }

    cout << "Робота завершена!" << endl;
    std::system("pause");
}
